Autodesk.Revit.DB.Structure.PathReinforcement.IsValidRebarShapeId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies whether an element id corresponds to a Rebar Shape element which can be used in Path Reinforcement.
Remarks:
The Rebar Shape has to be two dimensional shape only
and its neighbouring segments may form only right angles.
Rebar Shapes that have end treatments or crank ar not allowed.
aDoc:
The document.
elementId:
An element id.
Returns:
True if the specified element id corresponds to a Rebar Shape element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.PathReinforcement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},System.Boolean,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new PathReinforcement object from an array of curves and given Rebar Shape id.
Remarks:
The method sets Rebar Shape of primary bars only.
document:
The document.
hostElement:
The element that will host the PathReinforcement. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
curveArray:
An array of curves that will define the outline of the PathReinforcement.
flip:
A flag controlling the bars relative to the curves.
pathReinforcementTypeId:
The id of the PathReinforcementType.
rebarBarTypeId:
The id of the RebarBarType.
startRebarHookTypeId:
The id of the RebarHookType for the start of the bar.
If this parameter is InvalidElementId, it means to create a rebar with no start hook.
endRebarHookTypeId:
The id of the RebarHookType for the end of the bar.
If this parameter is InvalidElementId, it means to create a rebar with no end hook.
rebarShapeId:
The id of the RebarShape element that defines the shape of the rebars in the object.
Returns:
The newly created PathReinforcement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curveArray is empty.
-or-
The input curveArray contains at least one helical curve and is not supported for this operation.
-or-
The element hostElement was not found in the given document.
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
The structural rebar is not within area and path reinforcement.
-or-
curves in curveArray are not continuous and open.
-or-
pathReinforcementTypeId should refer to an Path Reinforcement Type element.
-or-
rebarBarTypeId should refer to an RebarBarType element.
-or-
startRebarHookTypeId should be invalid or refer to an RebarHookType element.
-or-
endRebarHookTypeId should be invalid or refer to an RebarHookType element.
-or-
rebarShapeId should refer to two dimensional Rebar Shape element with segments forming only right angles,
or the Rebar Shape has at least one end treatment or it has at least one crank.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
startRebarHookTypeId cannot be set for given rebar shape.
-or-
endRebarHookTypeId cannot be set for given rebar shape.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Since:
2016

Autodesk.Revit.DB.Structure.PathReinforcement.AlternatingBarShapeId
The RebarShape element that defines the shape of the alternating bars of the Path Reinforcement.
Remarks:
Changing the value of this property causes the Path Reinforcement to choose values for its
shape parameters.
Before calling this method, alternating bars have to be enabled in the Path Reinforcement by setting PATH_REIN_ALTERNATING BuiltInParameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: shapeId should refer to two dimensional Rebar Shape element with segments forming only right angles,
or the Rebar Shape has at least one end treatment or it has at least one crank.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This Path Reinforcement does not have alternating bars enabled.
-or-
When setting this property: This PathReinforcement does not host Rebar.
Since:
2016

Autodesk.Revit.DB.Structure.PathReinforcement.PrimaryBarShapeId
The RebarShape element that defines the shape of the primary bars of the Path Reinforcement.
Remarks:
Changing the value of this property causes the Path Reinforcement to choose values for its
shape parameters.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: shapeId should refer to two dimensional Rebar Shape element with segments forming only right angles,
or the Rebar Shape has at least one end treatment or it has at least one crank.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This PathReinforcement does not host Rebar.
Since:
2016